{
  "name1": "iReX",
  "name2": "Web-Development",
  "email": "okoshevy@gmail.com",
  "email2": "aleksandr.shatalin048.work1@gmail.com",
  "phone": "+38 (067) 483-89-65",
  "phone2": "+38 (063) 196-69-91",
  "text1": "We build websites that stand out!",
  "text2": "Empowering your online presence with creative websites!",
  "about1": "We are the iReX team, where technical expertise intertwines with the magic of creativity. Our projects are not just websites; they are unique platforms that help brands grow and thrive in the digital world. Over the years of working on various projects, we have created our own success story.",
  "about2": "Each website is not just code and design; it is the energy we invest in every project to ensure its uniqueness and effectiveness. Our team deeply understands the specifics of your business, providing a personalized approach and a full range of services to achieve your goals in the online world. Your success is our success, and we are always here to provide your brand with the highest level of attention and technical expertise.",
  "about3": "Our projects include the development of interactive and user-friendly interfaces that ensure an excellent user experience. While working on projects, we pay attention to detail and strive to write high-quality code. Our goal is not only to build efficient and aesthetically pleasing web applications but also to continuously grow in the field of development by keeping up with the latest trends and advanced methods. We are ready to embrace new challenges and opportunities that will allow us to further our growth and contribute to the advancement of innovative technologies.",
  "about4": "Ready for effective collaboration? We are excited to discuss your ideas and offer the best solutions to enhance your online presence. We believe that successful projects are born from close collaboration, where professional skills, experience, and your ideas come together.",
  "about5": "We are specializes in creating complex web applications and backend services for various industries. Below is a summary of the projects we've completed so far:",
  "about6": "Our team of specialists is dedicated to creating unique, highly functional, and impactful websites that help your business stand out and achieve success. If you have any questions, ideas, or are ready to start a project, feel free to contact us — we look forward to the opportunity to help you create something truly remarkable!",
  "github_link": "https://github.com/SonGlad",
  "facebook_link": "https://www.facebook.com/profile.php?id=100024930558745",
  "linkedin_link": "https://www.linkedin.com/in/oleg-koshevy/",
  "telegram_link": "https://t.me/SonGlad",
  "telegram_link2": "https://t.me/mentholitty048",
  "instagram_link": "https://www.instagram.com/mentholitty048?igsh=MWZqMHB5a2x4azR2aw==",
  "steps": {
    "projectPlanning":{
      "description": "At this stage, the project's goal and its main objectives are defined. It includes gathering your requirements, analyzing business processes, identifying the target audience, and determining the product’s functionality. We create a detailed plan, breaking the project into phases, setting deadlines, allocating resources, and assigning responsibilities. The primary aim is to establish a clear understanding of what will be developed and how it will be done.",
      "value": "10",
      "img": "https://i.imgur.com/dCuguuB.jpg",
      "name": "Project Planning"
    },
    "designPrototyping":{
      "description": "After the planning phase, the product design process begins. At this stage, visual wireframes and prototypes are created to help visualize the structure and user interaction with the interface. Designers focus on the user interface (UI) and user experience (UX) to ensure ease of use. The prototypes are tested and discussed with you before development starts, allowing for adjustments to be made early on.",
      "value": "15",
      "img": "https://i.imgur.com/JEUYXQG.jpg",
      "name": "Design & Prototyping"
    },
    "backend":{
      "description": "This phase is responsible for building the server-side of the application, including databases, servers, APIs, and business logic. Here, we work with backend technologies to handle data storage, process requests, manage users, and ensure system security. A key focus during this phase is ensuring smooth interaction between the client-side and server-side through the use of APIs.",
      "value": "25",
      "img": "https://i.imgur.com/5mW9L9u.jpg",
      "name": "Backend Development"
    },
    "frontend":{
      "description": "The frontend development phase focuses on building the interface that users interact with. We are responsible for creating the visual components and ensuring smooth user interaction with the system. The technologies previously outlined are utilized. Our main goal is to deliver a user-friendly, intuitive interface that functions properly across various devices and meets modern standards.",
      "value": "30",
      "img": "https://i.imgur.com/BezEQVP.jpg",
      "name": "Frontend Development"
    },
    "testing":{
      "description": "Testing involves checking all aspects of the application's functionality. We conduct tests to ensure it meets the requirements, identify bugs, and assess how the system performs in various scenarios. This phase includes both functional testing (ensuring all features work as expected) and non-functional testing (performance, security, usability). The main goal is to ensure the product is ready for release and operates without errors.",
      "value": "10",
      "img": "https://i.imgur.com/1O2ixNe.jpg",
      "name": "Testing & QA"
    },
    "deploying":{
      "description": "After the development and testing phases are complete, the project is deployed to a live server or hosting platform, making the product accessible to end users. At this point, the support phase begins, which includes monitoring the application's performance, fixing bugs, enhancing functionality, applying security updates, and handling other tasks to maintain and update the product throughout its lifecycle.",
      "value": "10",
      "img": "https://i.imgur.com/pLAlJOc.jpg",
      "name": "Deployment & Maintenance"
    }
  },
  "skills":[
    { "id": "IconReact",
      "value": "React",
      "link": "https://react.dev",
      "translatedType": "Frontend",
      "description": "A library for building user interfaces."
    },
    { "id": "IconRedux",
      "value": "Redux",
      "link": "https://redux.js.org",
      "translatedType": "Frontend",
      "description": "State management for React applications."
    },
    { "id": "IconHTML",
      "value": "HTML 5",
      "link": "https://html.spec.whatwg.org",
      "translatedType": "Frontend",
      "description": "The main foundation for creating web pages."
    },
    { "id": "IconJavaScript",
      "value": "JavaScript",
      "link": "https://developer.mozilla.org/en-US/docs/Learn/JavaScript",
      "translatedType": "Frontend, Backend",
      "description": "The main language for frontend & backend development."
    },
    { "id": "IconCSS",
      "value": "CSS 3",
      "link": "https://developer.mozilla.org/en-US/docs/Web/CSS",
      "translatedType": "Frontend",
      "description": "Styling for web pages."
    },
    { "id": "IconGit",
      "value": "Git",
      "link": "https://git-scm.com",
      "translatedType": "DevOps",
      "description": "A version control system for tracking changes in code."
    },
    { "id": "IconGitHub",
      "value": "GitHub",
      "link": "https://github.com",
      "translatedType": "DevOps",
      "description": "A platform for hosting and managing repositories."
    },
    { "id": "IconVS",
      "value": "Visual Studio",
      "link": "https://code.visualstudio.com",
      "translatedType": "Dev-Tools",
      "description": "A popular code editor for web developers."
    },
    { "id": "IconNode",
      "value": "Node.js",
      "link": "https://nodejs.org/en",
      "translatedType": "Backend",
      "description": "A runtime for executing JavaScript on the server side."
    },
    { "id": "IconSASS",
      "value": "SASS / SCSS",
      "link": "https://sass-lang.com",
      "translatedType": "Frontend",
      "description": "A CSS preprocessor for enhanced styling."
    },
    { "id": "IconHandlebars",
      "value": "Handlebars",
      "link": "https://handlebarsjs.com",
      "translatedType": "Frontend, Backend",
      "description": "A template engine for server-side & front-end rendering."
    },
    { "id": "IconMongoDB",
      "value": "MongoDB",
      "link": "https://www.mongodb.com/cloud/atlas/register?utm_source=google&utm_campaign=search_gs_pl_evergreen_atlas_core_prosp-brand_gic-null_emea-ua_ps-all_desktop_eng_lead&utm_term=mongodb&utm_medium=cpc_paid_search&utm_ad=e&utm_ad_campaign_id=12212624575&adgroup=115749710823&cq_cmp=12212624575&gad_source=1&gclid=CjwKCAiA_OetBhAtEiwAPTeQZy-VKImwt1qJHg8yNCl4a_hX5XmBxUh821Oa4HKoboH2OUpctL_ewhoCh7kQAvD_BwE",
      "translatedType": "Backend",
      "description": "A document-oriented NoSQL database."
    },
    { "id": "IconAxios",
      "value": "Axios",
      "link": "https://axios-http.com/docs/api_intro",
      "translatedType": "Backend, Frontend",
      "description": "An HTTP client for API interaction."
    },
    { "id": "IconPostman",
      "value": "Postman",
      "link": "https://www.postman.com",
      "translatedType": "DevOps",
      "description": "A tool for testing and interacting with APIs."
    },
    { "id": "IconStyled",
      "value": "Styled Components",
      "link": "https://styled-components.com",
      "translatedType": "Frontend",
      "description": "A library for styled components in React."
    },
    { "id": "IconFigma",
      "value": "Figma",
      "link": "https://www.figma.com",
      "translatedType": "Dev-Tools",
      "description": "A tool for creating designs and prototypes."
    },
    { "id": "IconRender",
      "value": "Render",
      "link": "https://render.com",
      "translatedType": "DevOps",
      "description": "A cloud platform for hosting and automatic application deployment."
    },
    { "id": "IconNetlify",
      "value": "Netlify",
      "link": "https://app.netlify.com",
      "translatedType": "DevOps",
      "description": "A platform for automatically deploying static sites."
    },
    { "id": "IconGoDaddy",
      "value": "GoDaddy",
      "link": "https://www.godaddy.com/en-uk",
      "translatedType": "DevOps",
      "description": "A provider of domains and hosting services."
    }
  ]
}
